RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_gpio.c
/*******************************************************************************
* Function Name: Cy_GPIO_GetFilter
****************************************************************************//**
*
* Returns which pin is currently configured to connect to the port-specific
* glitch filter.
*
* Each port contains a single 50ns glitch filter. Any of the pins on the port
* can be routed to this filter such that the input signal is filtered before
* reaching the edge-detect interrupt circuitry. The state of the filtered pin
* can also be read by calling the Cy_GPIO_Read() function.
*
* \param base
* Pointer to the pin's port register base address
*
* \return
* The number of the port pin routed to the port filter (0...7)
*
* \funcusage
* \snippet gpio/snippet/main.c snippet_Cy_GPIO_SetFilter
*
*******************************************************************************/
uint32_t Cy_GPIO_GetFilter(GPIO_PRT_Type* base)
{
    uint32_t tempReg;
#if (CY_CPU_CORTEX_M4) && defined(CY_DEVICE_SECURE) && defined(CY_DEVICE_PSOC6ABLE2)
    if (CY_PRA_IS_PORT_SECURE(base))
    {
        tempReg = CY_PRA_REG32_GET(CY_PRA_GET_PORT_REG_INDEX(base, CY_PRA_SUB_INDEX_PORT_INTR_CFG));
    }
    else
    {
        tempReg = GPIO_PRT_INTR_CFG(base);
    }
#else
    tempReg = GPIO_PRT_INTR_CFG(base);
#endif /* (CY_CPU_CORTEX_M4) && defined(CY_DEVICE_SECURE) && defined(CY_DEVICE_PSOC6ABLE2) */

    return ((tempReg >> CY_GPIO_INTR_FILT_OFFSET) & CY_GPIO_INTR_FLT_EDGE_MASK);
}

#if defined (CY_IP_MXS22IOSS)
/*******************************************************************************
* Function Name: Cy_GPIO_SetI3C_PullUpMode
****************************************************************************//**
*
* Configure the GPIO pin I3C Pull-up mode.
*
* \param base
* Pointer to the pin's port register base address
*
* \param pinNum
* Position of the pin bit-field within the port register
*
* \param value
* I3C Pull-up mode for a pin. Options are detailed in 
* \ref group_gpio_i3cPullUpMode macros
*
* \note
* This function modifies a port register in a read-modify-write operation. It is
* not thread safe as the resource is shared among multiple pins on a port.
*
* \note
* This API is available for the CAT1D devices.
*
* \funcusage
* \snippet gpio/snippet/main.c snippet_Cy_GPIO_SetI3C_PullUpMode
*
*******************************************************************************/
void Cy_GPIO_SetI3C_PullUpMode(GPIO_PRT_Type* base, uint32_t pinNum, uint32_t value)
{
    uint32_t tempReg;
    uint32_t pinLoc;
    uint32_t prtCfg;

    CY_ASSERT_L2(CY_GPIO_IS_PIN_VALID(pinNum));
    CY_ASSERT_L2(CY_GPIO_IS_I3C_PULLUP_VALID(value));

    pinLoc = pinNum << CY_GPIO_CFG_RES_I3C_PULLUP_MODE_OFFSET;
    tempReg = (GPIO_PRT_CFG_RES(base) & ~(CY_GPIO_CFG_RES_I3C_PULLUP_MODE_MASK << pinLoc));
    prtCfg = tempReg | ((value & CY_GPIO_CFG_RES_I3C_PULLUP_MODE_MASK) << pinLoc);

    GPIO_PRT_CFG_RES(base) = prtCfg;
}

/*******************************************************************************
* Function Name: Cy_GPIO_GetI3C_PullUpMode
****************************************************************************//**
*
* Returns the current I3C Pull-up mode of GPIO Pin.
*
* \param base
* Pointer to the pin's port register base address
*
* \param pinNum
* Position of the pin bit-field within the port register
*
* \return
* I3C Pull-up mode. Options are detailed in \ref group_gpio_i3cPullUpMode macros
*
* \note
* This API is available for the CAT1D devices.
*
* \funcusage
* \snippet gpio/snippet/main.c snippet_Cy_GPIO_SetI3C_PullUpMode
*
*******************************************************************************/
uint32_t Cy_GPIO_GetI3C_PullUpMode(GPIO_PRT_Type* base, uint32_t pinNum)
{
    uint32_t tempReg;

    CY_ASSERT_L2(CY_GPIO_IS_PIN_VALID(pinNum));

    tempReg = GPIO_PRT_CFG_RES(base);

    return (tempReg >> (pinNum << CY_GPIO_CFG_RES_I3C_PULLUP_MODE_OFFSET)) & CY_GPIO_CFG_RES_I3C_PULLUP_MODE_MASK;
}

/*******************************************************************************
* Function Name: Cy_GPIO_SetExtDrivemode
****************************************************************************//**
*
* Configures the extra drive mode for a pin.
*
* \param base
* Pointer to the pin's port register base address
*
* \param pinNum
* Position of the pin bit-field within the port register
*
* \param value
* Pin drive mode. Options are detailed in \ref group_gpio_extDriveModes macros
*
* \note
* This function modifies a port register in a read-modify-write operation. It is
* not thread safe as the resource is shared among multiple pins on a port.
*
* \funcusage
* \snippet gpio/snippet/main.c snippet_Cy_GPIO_SetExtDrivemode
*
*******************************************************************************/
void Cy_GPIO_SetExtDrivemode(GPIO_PRT_Type* base, uint32_t pinNum, uint32_t value)
{
    uint32_t tempReg;
    uint32_t pinLoc;
    uint32_t prtCfg;

    CY_ASSERT_L2(CY_GPIO_IS_PIN_VALID(pinNum));
    CY_ASSERT_L2(CY_GPIO_IS_EXT_DM_VALID(value));

    pinLoc = pinNum << CY_GPIO_CFG_OUT3_EXT_DRIVE_MODE_OFFSET;
    tempReg = (GPIO_PRT_CFG_OUT3(base) & ~(CY_GPIO_CFG_OUT3_EXT_DM_MASK << pinLoc));
    prtCfg = tempReg | ((value & CY_GPIO_CFG_OUT3_EXT_DM_MASK) << pinLoc);
    GPIO_PRT_CFG_OUT3(base) = prtCfg;
}

/*******************************************************************************
* Function Name: Cy_GPIO_GetExtDrivemode
****************************************************************************//**
*
* Returns the extra drive mode for a pin.
*
* \param base
* Pointer to the pin's port register base address
*
* \param pinNum
* Position of the pin bit-field within the port register
*
* \return
* Pin drive mode. Options are detailed in \ref group_gpio_extDriveModes macros
*
* \funcusage
* \snippet gpio/snippet/main.c snippet_Cy_GPIO_SetExtDrivemode
*
*******************************************************************************/
uint32_t Cy_GPIO_GetExtDrivemode(GPIO_PRT_Type* base, uint32_t pinNum)
{
    uint32_t tempReg;

    CY_ASSERT_L2(CY_GPIO_IS_PIN_VALID(pinNum));

    tempReg = GPIO_PRT_CFG_OUT3(base);

    return (tempReg >> (pinNum << CY_GPIO_CFG_OUT3_EXT_DRIVE_MODE_OFFSET)) & CY_GPIO_CFG_OUT3_EXT_DM_MASK;
}
#endif /* CY_IP_MXS22IOSS */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS40SIOSS, CY_IP_MXS40IOSS, CY_IP_MXS22IOSS */
/* [] END OF FILE */
